Revit 2027 API
BuiltInFailures.MEPCalculationFailures.InvalidNumberOfMechanicalEquipmentOnDuty Property
 The number of on duty equipment must be less than or equal to the number of available equipments.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidNumberOfMechanicalEquipmentOnDuty { get; }
Public Shared ReadOnly Property InvalidNumberOfMechanicalEquipmentOnDuty As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidNumberOfMechanicalEquipmentOnDuty {
	FailureDefinitionId^ get ();
}
static member InvalidNumberOfMechanicalEquipmentOnDuty : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace